content/posts/2024/04/10/manually-creating-epub-from-scratch.org
#+title: Manually creating epub from scratch (With template)
#+DATE: <2024-04-10 Wed>
#+DESCRIPTION: This post shows you how and why you may want to create epub from scratch.

* The why
:PROPERTIES:
:CUSTOM_ID: the-why
:END:

I needed to create an ebook in epub format in Japanese. First issue I had was not being able to display the text vertically. I tried to use LibreOffice export to epub option, tried to use Calibre to mess around with options, I tried to look through the exported epub to try and change some stuff. Nothing worked. I am sure there is a way to do it through these software but I was not able to find a way to make it work. Second issue I had was the layout was messed up even in horizontal mode. There were weird inconsistencies and gaps between paragraphs or re-flow issues.  By then, I had wasted enough time and decided to create epub from scratch.

Not sure if it exists now but there was no complete guide to creating an epub from scratch when I did my epub (especially for epub 3.3). Here is my attempt at it. You can also find the template on GitLab and GitHub.

* The how
:PROPERTIES:
:CUSTOM_ID: the-how
:END:

epub format is just a regular zip file but with a different extension. You can change the extension to zip and extract it to see the contents. It contains some meta information files that ebook readers use to know how to put all the files together to display it on screen. Rest of the files are content files such as text, images, videos, audios etc. Just like a website.

Inside, you will find that there are some files and folders. The basic structure of epub is shown below.

#+begin_src
.
├── META-INF
│   └── container.xml
├── mimetype
└── OEBPS
    ├── content.opf
    ├── images
    │   └── cover.jpg
    ├── styles
    │   └── stylesheet.css
    └── text
        ├── text2.xhtml
        ├── text3.xhtml
        ├── text.xhtml
        └── nav.xhtml

#+end_src

** META-INF
:PROPERTIES:
:CUSTOM_ID: meta-inf
:END:

In this folder, there is a file called container.xml. This defines the location of content.opf . You may change the name of the content folder (in this case OEBPS) to something else and this must be changed in the container.xml file. You may have more information and files in this folder but container.xml is required.

Here is an example of container.xml.

#+begin_src xml

<?xml version='1.0' encoding='utf-8'?>
<container xmlns="urn:oasis:names:tc:opendocument:xmlns:container" version="1.0">
  <rootfiles>
    <rootfile full-path="OEBPS/content.opf" media-type="application/oebps-package+xml"/>
  </rootfiles>
</container>

#+end_src

** mimetype
:PROPERTIES:
:CUSTOM_ID: mimetype
:END:

This defines that this file is an epub file.

Here is the content.

#+begin_src

application/epub+zip

#+end_src

** OEBPS
:PROPERTIES:
:CUSTOM_ID: oebps
:END:

As stated in the META_INF section, you can change the name of the folder if you wish. The most important file in this folder is content.opf. This defines the location and order of the content to be displayed. You can also define certain metadata.

