public/posts/2024/04/10/manually-creating-epub-from-scratch.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-01-16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Manually creating epub from scratch (With template)</title>
<meta name="author" content="Zagyarakushi" />
<meta name="description" content="This post shows you how and why you may want to create epub from scratch." />
<meta name="generator" content="Org Mode" />
<meta name="robots" content="noindex">
<meta name="robots" content="nofollow">
<meta name="robots" content="noarchive">
<meta name="robots" content="nocache">
<meta name="robots" content="notranslate">
<meta name="robots" content="noimageindex">
<meta name="robots" content="nosnippet">
<meta name="referrer" content="noreferrer">
<link rel="stylesheet" type="text/css" href="/res/css/simple.css">
<link rel="stylesheet" type="text/css" href="/res/css/custom.css">
<link rel="alternate" type="application/rss+xml" href="/rss.xml" title="RSS feed">
<link rel="apple-touch-icon" sizes="180x180" href="https://zagyarakushi.gitlab.io/res/icons/apple-touch-icon.png">
<link rel="manifest" href="https://zagyarakushi.gitlab.io/res/icons/site.webmanifest">
<link rel="icon" type="image/png" sizes="32x32" href="https://zagyarakushi.gitlab.io/res/icons/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="https://zagyarakushi.gitlab.io/res/icons/favicon-16x16.png">
<link rel="icon" type="image/x-icon" href="https://zagyarakushi.gitlab.io/res/icons/favicon.ico">
<meta property="og:title" content="Manually creating epub from scratch (With template)">
<meta property="og:url" content="https://zagyarakushi.gitlab.io/posts/2024/04/10/manually-creating-epub-from-scratch.html">
<meta property="og:description" content="This post shows you how and why you may want to create epub from scratch.">
<meta property="og:image" content="https://zagyarakushi.gitlab.io/res/icons/ogimage.png">
<meta property="og:type" content="article">
<meta property="article:author" content="Zagyarakushi">
<meta property="article:published_time" content="2024-06-29T00:00:00+0100">
<meta property="twitter:title" content="Manually creating epub from scratch (With template)">
<meta property="twitter:url" content="https://zagyarakushi.gitlab.io/posts/2024/04/10/manually-creating-epub-from-scratch.html">
<meta property="twitter:image" content="https://zagyarakushi.gitlab.io/res/icons/ogimage.png">
<meta property="twitter:description" content="This post shows you how and why you may want to create epub from scratch.">
<meta property="twitter:card" content="summary">
</head>
<body>
<header id="top" class="status">
<h1><a href="/" title="Zagyarakushi">Zagyarakushi</a></h1>
<nav>
  <a href="/">Home</a>
  <a href="/posts/blog.html">Blog</a>
  <a href="/projects/projects.html">Projects</a>
  <a href="/interesting.html">Interesting Stuff</a>
  <a href="/past-research/past-research.html">Past Research</a>
  <a href="/about.html">About</a>
  <a href="/donate.html">Donate</a>
</nav>
<div id="last-updated">Last Updated: 2024-07-10</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Manually creating epub from scratch (With template)</h1>
<p class="subtitle" role="doc-subtitle">Posted on 2024-06-29</p>
</header>
<section id="outline-container-the-why" class="outline-2">
<h2 id="the-why"><a href="#the-why">The why</a></h2>
<div class="outline-text-2" id="text-the-why">
<p>
I needed to create an ebook in epub format in Japanese. First issue I had was not being able to display the text vertically. I tried to use LibreOffice export to epub option, tried to use Calibre to mess around with options, I tried to look through the exported epub to try and change some stuff. Nothing worked. I am sure there is a way to do it through these software but I was not able to find a way to make it work. Second issue I had was the layout was messed up even in horizontal mode. There were weird inconsistencies and gaps between paragraphs or re-flow issues.  By then, I had wasted enough time and decided to create epub from scratch.
</p>

<p>
Not sure if it exists now but there was no complete guide to creating an epub from scratch when I did my epub (especially for epub 3.3). Here is my attempt at it. You can also find the template on GitLab and GitHub.
</p>
</div>
</section>

<section id="outline-container-the-how" class="outline-2">
<h2 id="the-how"><a href="#the-how">The how</a></h2>
<div class="outline-text-2" id="text-the-how">
<p>
epub format is just a regular zip file but with a different extension. You can change the extension to zip and extract it to see the contents. It contains some meta information files that ebook readers use to know how to put all the files together to display it on screen. Rest of the files are content files such as text, images, videos, audios etc. Just like a website.
</p>

<p>
Inside, you will find that there are some files and folders. The basic structure of epub is shown below.
</p>

<pre class="example">
.
├── META-INF
│   └── container.xml
├── mimetype
└── OEBPS
    ├── content.opf
    ├── images
    │   └── cover.jpg
    ├── styles
    │   └── stylesheet.css
    └── text
        ├── text2.xhtml
        ├── text3.xhtml
        ├── text.xhtml
        └── nav.xhtml

</pre>
</div>

<div id="outline-container-meta-inf" class="outline-3">
<h3 id="meta-inf"><a href="#meta-inf">META-INF</a></h3>
<div class="outline-text-3" id="text-meta-inf">
<p>
In this folder, there is a file called container.xml. This defines the location of content.opf . You may change the name of the content folder (in this case OEBPS) to something else and this must be changed in the container.xml file. You may have more information and files in this folder but container.xml is required.
</p>

<p>
Here is an example of container.xml.
</p>

<div class="org-src-container">
<pre class="src src-xml">
<span class="org-nxml-processing-instruction-delimiter">&lt;?</span><span class="org-nxml-processing-instruction-target">xml</span> <span class="org-nxml-processing-instruction-content">version='1.0' encoding='utf-8'</span><span class="org-nxml-processing-instruction-delimiter">?&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">container</span> <span class="org-nxml-namespace-attribute-xmlns">xmlns</span>=<span class="org-string">"urn:oasis:names:tc:opendocument:xmlns:container"</span> <span class="org-nxml-attribute-local-name">version</span>=<span class="org-string">"1.0"</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">rootfiles</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">rootfile</span> <span class="org-nxml-attribute-local-name">full-path</span>=<span class="org-string">"OEBPS/content.opf"</span> <span class="org-nxml-attribute-local-name">media-type</span>=<span class="org-string">"application/oebps-package+xml"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">rootfiles</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">container</span><span class="org-nxml-tag-delimiter">&gt;</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-mimetype" class="outline-3">
<h3 id="mimetype"><a href="#mimetype">mimetype</a></h3>
<div class="outline-text-3" id="text-mimetype">
<p>
This defines that this file is an epub file.
</p>

<p>
Here is the content.
</p>

<pre class="example">

application/epub+zip

</pre>
</div>
</div>

<div id="outline-container-oebps" class="outline-3">
<h3 id="oebps"><a href="#oebps">OEBPS</a></h3>
<div class="outline-text-3" id="text-oebps">
<p>
As stated in the META_INF section, you can change the name of the folder if you wish. The most important file in this folder is content.opf. This defines the location and order of the content to be displayed. You can also define certain metadata.
</p>
</div>
