content/posts/2024/04/10/manually-creating-epub-from-scratch.org
*** content.ops
:PROPERTIES:
:CUSTOM_ID: contentops
:END:

Here is an example content.opf

#+begin_src xml

<?xml version="1.0"  encoding="UTF-8"?>
<package xmlns="http://www.idpf.org/2007/opf" unique-identifier="unique-identifier" version="3.0">
  <metadata xmlns="http://www.idpf.org/2007/opf" xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:dcterms="http://purl.org/dc/terms/" xmlns:opf="http://www.idpf.org/2007/opf">
    <dc:identifier id="unique-identifier">b62482e5-6a3a-4f4c-b73a-ee3292ff8068</dc:identifier>
    <dc:title>Title</dc:title>
    <dc:language>en</dc:language>
    <meta property="dcterms:modified">2024-04-27T13:00:00Z</meta>
    <dc:creator id="creator">Creator Name</dc:creator>
    <meta refines="#creator" property="role" scheme="marc:relators" id="role">aut</meta>
    <meta refines="#creator" property="alternate-script" xml:lang="ja">Creator Name</meta>
    <meta refines="#creator" property="file-as">Name, Creator</meta>
  </metadata>
  <manifest>
    <item id="cover"
          href="./images/cover.jpg"
          properties="cover-image"
          media-type="image/jpeg"/>
    <item id="text"
          href="./text/text.xhtml"
          media-type="application/xhtml+xml"/>
    <item id="text2"
          href="./text/text2.xhtml"
          properties="nav"
          media-type="application/xhtml+xml"/>
    <item id="text3"
          href="./text/text3.xhtml"
          properties="nav"
          media-type="application/xhtml+xml"/>
    <item id="nav"
          href="./text/nav.xhtml"
          properties="nav"
          media-type="application/xhtml+xml"/>
    <item id="css"
          href="./styles/stylesheet.css"
          media-type="text/css"/>
  </manifest>
  <spine page-progression-direction="rtl">
    <itemref idref="nav"/>
    <itemref idref="text"/>
    <itemref idref="text2"/>
    <itemref idref="text3"/>
  </spine>
</package>


#+end_src

You will need to change identifier, title, language etc. In the manifest section, you will need to specify anything that will be included in the book. Even if they are not text pages. For example, images, videos and audios will need to go here. Spine section is where you specify the order of things. Mostly pages. Anything included here will be visible as a page. So in this case, if you don't want table of contents, then you can remove it here and it won't show up as a page. However, it will still be shown in the ebook reader as table of contents.

