public/posts/2024/04/10/manually-creating-epub-from-scratch.html

<div id="outline-container-contentops" class="outline-4">
<h4 id="contentops"><a href="#contentops">content.ops</a></h4>
<div class="outline-text-4" id="text-contentops">
<p>
Here is an example content.opf
</p>

<div class="org-src-container">
<pre class="src src-xml">
<span class="org-nxml-processing-instruction-delimiter">&lt;?</span><span class="org-nxml-processing-instruction-target">xml</span> <span class="org-nxml-processing-instruction-content">version="1.0"  encoding="UTF-8"</span><span class="org-nxml-processing-instruction-delimiter">?&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">package</span> <span class="org-nxml-namespace-attribute-xmlns">xmlns</span>=<span class="org-string">"http://www.idpf.org/2007/opf"</span> <span class="org-nxml-attribute-local-name">unique-identifier</span>=<span class="org-string">"unique-identifier"</span> <span class="org-nxml-attribute-local-name">version</span>=<span class="org-string">"3.0"</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">metadata</span> <span class="org-nxml-namespace-attribute-xmlns">xmlns</span>=<span class="org-string">"http://www.idpf.org/2007/opf"</span> <span class="org-nxml-namespace-attribute-xmlns">xmlns</span><span class="org-nxml-namespace-attribute-colon">:</span><span class="org-nxml-namespace-attribute-prefix">dc</span>=<span class="org-string">"http://purl.org/dc/elements/1.1/"</span> <span class="org-nxml-namespace-attribute-xmlns">xmlns</span><span class="org-nxml-namespace-attribute-colon">:</span><span class="org-nxml-namespace-attribute-prefix">dcterms</span>=<span class="org-string">"http://purl.org/dc/terms/"</span> <span class="org-nxml-namespace-attribute-xmlns">xmlns</span><span class="org-nxml-namespace-attribute-colon">:</span><span class="org-nxml-namespace-attribute-prefix">opf</span>=<span class="org-string">"http://www.idpf.org/2007/opf"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dc</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">identifier</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"unique-identifier"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">b62482e5-6a3a-4f4c-b73a-ee3292ff8068</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dc</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">identifier</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dc</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">title</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Title</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dc</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">title</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dc</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">language</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">en</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dc</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">language</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">meta</span> <span class="org-nxml-attribute-local-name">property</span>=<span class="org-string">"dcterms:modified"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">2024-04-27T13:00:00Z</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">meta</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dc</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">creator</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"creator"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Creator Name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dc</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">creator</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">meta</span> <span class="org-nxml-attribute-local-name">refines</span>=<span class="org-string">"#creator"</span> <span class="org-nxml-attribute-local-name">property</span>=<span class="org-string">"role"</span> <span class="org-nxml-attribute-local-name">scheme</span>=<span class="org-string">"marc:relators"</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"role"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">aut</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">meta</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">meta</span> <span class="org-nxml-attribute-local-name">refines</span>=<span class="org-string">"#creator"</span> <span class="org-nxml-attribute-local-name">property</span>=<span class="org-string">"alternate-script"</span> <span class="org-nxml-attribute-prefix">xml</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">lang</span>=<span class="org-string">"ja"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Creator Name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">meta</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">meta</span> <span class="org-nxml-attribute-local-name">refines</span>=<span class="org-string">"#creator"</span> <span class="org-nxml-attribute-local-name">property</span>=<span class="org-string">"file-as"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Name, Creator</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">meta</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">metadata</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">manifest</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">item</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"cover"</span>
          <span class="org-nxml-attribute-local-name">href</span>=<span class="org-string">"./images/cover.jpg"</span>
          <span class="org-nxml-attribute-local-name">properties</span>=<span class="org-string">"cover-image"</span>
          <span class="org-nxml-attribute-local-name">media-type</span>=<span class="org-string">"image/jpeg"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">item</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"text"</span>
          <span class="org-nxml-attribute-local-name">href</span>=<span class="org-string">"./text/text.xhtml"</span>
          <span class="org-nxml-attribute-local-name">media-type</span>=<span class="org-string">"application/xhtml+xml"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">item</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"text2"</span>
          <span class="org-nxml-attribute-local-name">href</span>=<span class="org-string">"./text/text2.xhtml"</span>
          <span class="org-nxml-attribute-local-name">properties</span>=<span class="org-string">"nav"</span>
          <span class="org-nxml-attribute-local-name">media-type</span>=<span class="org-string">"application/xhtml+xml"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">item</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"text3"</span>
          <span class="org-nxml-attribute-local-name">href</span>=<span class="org-string">"./text/text3.xhtml"</span>
          <span class="org-nxml-attribute-local-name">properties</span>=<span class="org-string">"nav"</span>
          <span class="org-nxml-attribute-local-name">media-type</span>=<span class="org-string">"application/xhtml+xml"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">item</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"nav"</span>
          <span class="org-nxml-attribute-local-name">href</span>=<span class="org-string">"./text/nav.xhtml"</span>
          <span class="org-nxml-attribute-local-name">properties</span>=<span class="org-string">"nav"</span>
          <span class="org-nxml-attribute-local-name">media-type</span>=<span class="org-string">"application/xhtml+xml"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">item</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-string">"css"</span>
          <span class="org-nxml-attribute-local-name">href</span>=<span class="org-string">"./styles/stylesheet.css"</span>
          <span class="org-nxml-attribute-local-name">media-type</span>=<span class="org-string">"text/css"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">manifest</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">spine</span> <span class="org-nxml-attribute-local-name">page-progression-direction</span>=<span class="org-string">"rtl"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">itemref</span> <span class="org-nxml-attribute-local-name">idref</span>=<span class="org-string">"nav"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">itemref</span> <span class="org-nxml-attribute-local-name">idref</span>=<span class="org-string">"text"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">itemref</span> <span class="org-nxml-attribute-local-name">idref</span>=<span class="org-string">"text2"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">itemref</span> <span class="org-nxml-attribute-local-name">idref</span>=<span class="org-string">"text3"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">spine</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">package</span><span class="org-nxml-tag-delimiter">&gt;</span>


</pre>
</div>

<p>
You will need to change identifier, title, language etc. In the manifest section, you will need to specify anything that will be included in the book. Even if they are not text pages. For example, images, videos and audios will need to go here. Spine section is where you specify the order of things. Mostly pages. Anything included here will be visible as a page. So in this case, if you don&rsquo;t want table of contents, then you can remove it here and it won&rsquo;t show up as a page. However, it will still be shown in the ebook reader as table of contents.
</p>
</div>
</div>
