content/posts/2024/04/10/manually-creating-epub-from-scratch.org
*** nav.xhtml
:PROPERTIES:
:CUSTOM_ID: nav
:END:

This is the file that will show up on the ebook reader as table of contents. It does not have to be called nav.xhtml but needs to include a special metadata.

#+begin_src xml

<?xml version='1.0' encoding='utf-8'?>
<html xmlns:epub="http://www.idpf.org/2007/ops" xmlns="http://www.w3.org/1999/xhtml">
  <head><title>Table of Contents</title></head>
  <body>
    <nav epub:type="toc">
      <h1>Table of Contents</h1>
      <ol>
        <li>
          <a href="text.xhtml">Cover</a>
        </li>
        <li>
          <a href="text2.xhtml">Title</a>
        </li>
        <li>
          <a href="text3.xhtml">Wisdom</a>
        </li>
        <li>
          <a href="text4.xhtml">Disclaimer</a>
        </li>
      </ol>
    </nav>
  </body>
</html>

#+end_src

*** Stylesheet
:PROPERTIES:
:CUSTOM_ID: stylesheet
:END:

This is a standard css file. You can change the layout and the way your contents are displayed.

Example.

#+begin_src css

@page {
    margin:  5px 5px 5px 5px
}

body {
    writing-mode: vertical-rl
}

.upright-text {
    text-orientation: upright
}

.center-text {
    text-align: center
}

.horizontal-text {
    writing-mode: horizontal-tb
}

#+end_src

*** The content file
:PROPERTIES:
:CUSTOM_ID: content-file
:END:

This is where your content lives.

#+begin_src xml

<?xml version='1.0' encoding='utf-8'?>
<html xmlns='http://www.w3.org/1999/xhtml' xml:lang='en'>
  <head>
    <meta http-equiv='Content-Type' content='text/html; charset=UTF-8'/>
    <link href='../styles/stylesheet.css' rel='stylesheet' type='text/css'/>
    <title>TITLE</title>
  </head>
  <body>
    <div class="center-text horizontal-text">
      <h2>HEADER</h2>
    </div>
    <p>Some text here</p>
    <p>You can also use<br />
        breaks</p>
  </body>
</html>

#+end_src

