public/posts/2024/04/10/manually-creating-epub-from-scratch.html

<div id="outline-container-nav" class="outline-4">
<h4 id="nav"><a href="#nav">nav.xhtml</a></h4>
<div class="outline-text-4" id="text-nav">
<p>
This is the file that will show up on the ebook reader as table of contents. It does not have to be called nav.xhtml but needs to include a special metadata.
</p>

<div class="org-src-container">
<pre class="src src-xml">
<span class="org-nxml-processing-instruction-delimiter">&lt;?</span><span class="org-nxml-processing-instruction-target">xml</span> <span class="org-nxml-processing-instruction-content">version='1.0' encoding='utf-8'</span><span class="org-nxml-processing-instruction-delimiter">?&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">html</span> <span class="org-nxml-namespace-attribute-xmlns">xmlns</span><span class="org-nxml-namespace-attribute-colon">:</span><span class="org-nxml-namespace-attribute-prefix">epub</span>=<span class="org-string">"http://www.idpf.org/2007/ops"</span> <span class="org-nxml-namespace-attribute-xmlns">xmlns</span>=<span class="org-string">"http://www.w3.org/1999/xhtml"</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">head</span><span class="org-nxml-tag-delimiter">&gt;&lt;</span><span class="org-nxml-element-local-name">title</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Table of Contents</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">title</span><span class="org-nxml-tag-delimiter">&gt;&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">head</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">body</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">nav</span> <span class="org-nxml-attribute-prefix">epub</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">type</span>=<span class="org-string">"toc"</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">h1</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Table of Contents</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">h1</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">ol</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">li</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">a</span> <span class="org-nxml-attribute-local-name">href</span>=<span class="org-string">"text.xhtml"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Cover</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">a</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">li</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">li</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">a</span> <span class="org-nxml-attribute-local-name">href</span>=<span class="org-string">"text2.xhtml"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Title</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">a</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">li</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">li</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">a</span> <span class="org-nxml-attribute-local-name">href</span>=<span class="org-string">"text3.xhtml"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Wisdom</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">a</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">li</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">li</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">a</span> <span class="org-nxml-attribute-local-name">href</span>=<span class="org-string">"text4.xhtml"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Disclaimer</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">a</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">li</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">ol</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">nav</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">body</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">html</span><span class="org-nxml-tag-delimiter">&gt;</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-stylesheet" class="outline-4">
<h4 id="stylesheet"><a href="#stylesheet">Stylesheet</a></h4>
<div class="outline-text-4" id="text-stylesheet">
<p>
This is a standard css file. You can change the layout and the way your contents are displayed.
</p>

<p>
Example.
</p>

<div class="org-src-container">
<pre class="src src-css">
<span class="org-builtin">@page</span> {
    <span class="org-css-property">margin</span>:  5px 5px 5px 5px
}

<span class="org-css-selector">body</span> {
    <span class="org-css-property">writing-mode</span>: vertical-rl
}

<span class="org-css-selector">.upright-text</span> {
    <span class="org-css-property">text-orientation</span>: upright
}

<span class="org-css-selector">.center-text</span> {
    <span class="org-css-property">text-align</span>: center
}

<span class="org-css-selector">.horizontal-text</span> {
    <span class="org-css-property">writing-mode</span>: horizontal-tb
}

</pre>
</div>
</div>
</div>

<div id="outline-container-content-file" class="outline-4">
<h4 id="content-file"><a href="#content-file">The content file</a></h4>
<div class="outline-text-4" id="text-content-file">
<p>
This is where your content lives.
</p>

<div class="org-src-container">
<pre class="src src-xml">
<span class="org-nxml-processing-instruction-delimiter">&lt;?</span><span class="org-nxml-processing-instruction-target">xml</span> <span class="org-nxml-processing-instruction-content">version='1.0' encoding='utf-8'</span><span class="org-nxml-processing-instruction-delimiter">?&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">html</span> <span class="org-nxml-namespace-attribute-xmlns">xmlns</span>=<span class="org-string">'http://www.w3.org/1999/xhtml'</span> <span class="org-nxml-attribute-prefix">xml</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">lang</span>=<span class="org-string">'en'</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">head</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">meta</span> <span class="org-nxml-attribute-local-name">http-equiv</span>=<span class="org-string">'Content-Type'</span> <span class="org-nxml-attribute-local-name">content</span>=<span class="org-string">'text/html; charset=UTF-8'</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">link</span> <span class="org-nxml-attribute-local-name">href</span>=<span class="org-string">'../styles/stylesheet.css'</span> <span class="org-nxml-attribute-local-name">rel</span>=<span class="org-string">'stylesheet'</span> <span class="org-nxml-attribute-local-name">type</span>=<span class="org-string">'text/css'</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">title</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">TITLE</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">title</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">head</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">body</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">div</span> <span class="org-nxml-attribute-local-name">class</span>=<span class="org-string">"center-text horizontal-text"</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">h2</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">HEADER</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">h2</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">div</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Some text here</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">You can also use</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">br</span> <span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">        breaks</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">body</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">html</span><span class="org-nxml-tag-delimiter">&gt;</span>

</pre>
</div>
</div>
</div>
</div>
